dirkdickler/ESP32_Marcel/src/main.cpp
		uint64_t cardSize = SD.cardSize() / (1024 * 1024);
		Serial.printf("SD Card Size: %lluMB\n", cardSize);
		Serial.printf("Total space: %lluMB\n", SD.totalBytes() / (1024 * 1024));
		Serial.printf("Used space: %lluMB\n", SD.usedBytes() / (1024 * 1024));

		File profile = SD.open("/IPCONFIG.TXT", FILE_READ);
		Serial.printf("Velkost subora je :%lu\r\n", profile.size());
		if (!profile)
		{
			Serial.println("Opening file to read failed");
		}
		else
		{
			Serial.println("File Content:");

			while (profile.available())
			{
				while (profile.available())
				{
					Serial.write(profile.read());
				}
				Serial.println("");
				Serial.println("File read done");
				Serial.println("=================");
			}
		}
	}

	ESPinfo();

	myObject["hello"] = " 11:22 Streda";
	myObject["true"] = true;
	myObject["x"] = 42;
	myObject2["Citac"] = 42;

	NacitajEEPROM_setting();
	//WiFi.mode(WIFI_MODE_STA);
	WiFi.mode(WIFI_MODE_APSTA);
	Serial.println("Creating Accesspoint");
	WiFi.softAP(soft_ap_ssid, soft_ap_password, 7, 0, 3);
	Serial.print("IP address:\t");
	Serial.println(WiFi.softAPIP());

	if (!WiFi.config(local_IP, gateway, subnet, primaryDNS, secondaryDNS))
	{
		Serial.println("STA Failed to configure");
	}

	WiFi.begin(NazovSiete, Heslo);
	u8_t aa = 0;
	while (WiFi.waitForConnectResult() != WL_CONNECTED && aa < 2)
	{
		Serial.print(".");
		aa++;
	}
	// Print ESP Local IP Address
	Serial.println(WiFi.localIP()); //TODO test todo

	initWebSocket();

	FuncServer_On();

	AsyncElegantOTA.begin(&server, "qqq", "www"); // Start ElegantOTA

	configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
	//getLocalTime(&MyRTC_cas);
	server.begin();

	timer_1ms.start();
	timer_10ms.start();
	timer_100ms.start();
	timer_1sek.start();
	timer_10sek.start();
	esp_task_wdt_init(WDT_TIMEOUT, true); //enable panic so ESP32 restarts
	esp_task_wdt_add(NULL);				  //add current thread to WDT watch

	testik();

	//RS485 musis spustit az tu, lebo ak ju das hore a ESP ceka na konnect wifi, a pridu nejake data na RS485, tak FreeRTOS =RESET  asi overflow;
	Serial1.begin(9600);

	swSer.begin(115200);
	swSer.println("");
}

void loop()
{
	esp_task_wdt_reset();
	ws.cleanupClients();
	AsyncElegantOTA.loop();
	timer_1ms.update();
	timer_10ms.update();
	timer_100ms.update();
	timer_1sek.update();
	timer_10sek.update();
}

void Loop_1ms()
{
	if (RS485_toRx_timeout && Serial1.availableForWrite() == 127) //127 bytes je: PDF • 512 x 8-bit RAM shared by TX FIFOs and RX FIFOs of two UART controllers  128TX0 + 128Rx0 + 128TX1 + 128Rx1
	{
		if (--RS485_toRx_timeout == 0)
		{
			RS485_RxMode;
			Serial.println("[Loop 1ms]  Davam RS485 do RX mode");
		}
	}
}

void Loop_10ms()
{
#define indexData 14
	static uint8_t TimeOut_RXdata = 0;	 //musi byt static lebo sem skaces z Loop
	static uint16_t KolkkoNplnenych = 0; //musi byt static lebo sem skaces z Loop
	static char budd[250];				 //musi byt static lebo sem skaces z Loop

	uint16_t aktualny;
	char temp[200];

	aktualny = Serial1.available();
	if (aktualny)
	{

		//Serial2.readBytes (temp, aktualny);
		for (uint16_t i = 0; i < aktualny; i++)
		{
			if ((KolkkoNplnenych + aktualny) < sizeof(budd))
			{
				budd[KolkkoNplnenych + i] = Serial1.read();
			}
			else
			{
				Serial1.read();
			}
		}
		KolkkoNplnenych += aktualny;
		TimeOut_RXdata = 5;
	}

	if (TimeOut_RXdata)
	{
		if (--TimeOut_RXdata == 0)
		{
			{
				sprintf(temp, "[RS485] doslo:%u a to %s\r\n", KolkkoNplnenych, budd);
				DebugMsgToWebSocket(temp);
				//Serial.printf(temp);

				RS485_PACKET_t *loc_paket;
				loc_paket = (RS485_PACKET_t *)budd;

				sprintf(temp, "[RS485]  DST adresa je:%u\r\n", loc_paket->DSTadress);
				DebugMsgToWebSocket(temp);
				//Serial.printf(temp);

				sprintf(temp, "[RS485] Mam adresu %u a idem ulozit data z RS485\r\n", loc_paket->SCRadress);
				DebugMsgToWebSocket(temp);

				if (loc_paket->SCRadress == 10)
				{
					room[0].T_podlaha = budd[indexData + 4];
					room[0].T_podlaha <<= 8;
					room[0].T_podlaha += budd[indexData + 3];
					room[0].T_vzduch = budd[indexData + 6];
					room[0].T_vzduch <<= 8;
					room[0].T_vzduch += budd[indexData + 5];
					room[0].RH_vlhkkost = budd[indexData + 8];
					room[0].RH_vlhkkost <<= 8;
					room[0].RH_vlhkkost += budd[indexData + 7];
					room[0].T_podlaha_SET = budd[indexData + 10];
					room[0].T_podlaha_SET <<= 8;
					room[0].T_podlaha_SET += budd[indexData + 9];
					room[0].T_vzduch_SET = budd[indexData + 12];
					room[0].T_vzduch_SET <<= 8;
					room[0].T_vzduch_SET += budd[indexData + 11];
					room[0].RH_vlhkkost_SET = budd[indexData + 14];
					room[0].RH_vlhkkost_SET <<= 8;
					room[0].RH_vlhkkost_SET += budd[indexData + 13];
					room[0].teleso = budd[indexData + 15];

					OdosliStrankeVytapeniData();
				}

				memset(budd, 0, sizeof(budd));
				KolkkoNplnenych = 0;
			}
		}
	}
}

void Loop_100ms(void)
{
	static bool LedNahodena = false;

	if (LedNahodena == false)
	{
		LedNahodena = true;
		//digitalWrite(LedGreen, LOW);
		digitalWrite(LedOrange, LOW);
	}
	else
	{
		LedNahodena = false;
		//digitalWrite(LedGreen, HIGH);
		digitalWrite(LedOrange, HIGH);

		//RS485_TxMode;
		//Serial1.println("test RS485..orange LED High");
	}

	cnt++;

	//Serial.println("[100ms] Loop");
	if (0) //cnt >= 10)
	{
		cnt++;
		myObject2["Citac"] = cnt; // " 11:22 Stredaaaa";
		String jsonString = JSON.stringify(myObject2);
		Serial.print("[100ms] Toto je string co odoslen strankam:");
		Serial.println(jsonString);
		ws.textAll(jsonString);
	}
}

void Loop_1sek(void)
{
	Serial.print("[1sek Loop]  mam 1 sek....  ");
	if (Internet_CasDostupny == false)
	{
		Serial.print("Internet cas nedostupny !!,  ");
	}
	else
	{
		Serial.print("Internet cas dostupny,  ");
	}
	Serial.print("RTC cas cez func rtc.getTime: ");
	Serial.println(rtc.getTime("%A, %B %d %Y %H:%M:%S"));
	MyRTC_cas = rtc.getTimeStruct();
	//Serial.print("[1sek Loop]  free Heap je:");
	//Serial.println(ESP.getFreeHeap());

	String rr = "[1sek Loop] signalu: " + (String)WiFi.RSSI() + "dBm  a Heap: " + (String)ESP.getFreeHeap() + " kB\r\n";
	DebugMsgToWebSocket(rr);
}

void Loop_10sek(void)
{
	static u8_t loc_cnt = 0;
	//Serial.println("\r\n[10sek Loop]  Mam Loop 10 sek..........");
	DebugMsgToWebSocket("[10sek Loop]  mam 1 sek....\r\n");
	Serial.print("Wifi status:");
	Serial.println(WiFi.status());

	//https://randomnerdtutorials.com/esp32-useful-wi-fi-functions-arduino/
	if (WiFi.status() != WL_CONNECTED)
	{
		loc_cnt++;
		Internet_CasDostupny = false;
	}
	else
	{
		loc_cnt = 0;
		Serial.println("[10sek] Parada WIFI je Connect davam loc_cnt na Nula");

		//TODO ak je Wifi connect tak pocitam ze RTC cas bude OK este dorob
		Internet_CasDostupny = true;
		RTC_cas_OK = true;
	}

	if (loc_cnt == 2)
	{
		Serial.println("[10sek] Odpajam WIFI, lebo wifi nieje: WL_CONNECTED ");
		WiFi.disconnect(1, 1);
	}

